// constants/banks.ts

export const bankData = [
  { label: "ธนาคารกสิกรไทย (KBANK)", value: "ธนาคารกสิกรไทย" },
  { label: "ธนาคารไทยพาณิชย์ (SCB)", value: "ธนาคารไทยพาณิชย์" },
  { label: "ธนาคารกรุงเทพ (BBL)", value: "ธนาคารกรุงเทพ" },
  { label: "ธนาคารกรุงไทย (KTB)", value: "ธนาคารกรุงไทย" },
  { label: "ธนาคารกรุงศรีอยุธยา (BAY)", value: "ธนาคารกรุงศรีอยุธยา" },
  { label: "ธนาคารทหารไทยธนชาต (ttb)", value: "ธนาคารทหารไทยธนชาต" },
  { label: "ธนาคารออมสิน (GSB)", value: "ธนาคารออมสิน" },
  {
    label: "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (BAAC)",
    value: "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
  },
  { label: "ธนาคารอาคารสงเคราะห์ (GHB)", value: "ธนาคารอาคารสงเคราะห์" },
  { label: "ธนาคารเกียรตินาคินภัทร (KKP)", value: "ธนาคารเกียรตินาคินภัทร" },
  { label: "ธนาคารซีไอเอ็มบี ไทย (CIMB Thai)", value: "ธนาคารซีไอเอ็มบี ไทย" },
  { label: "ธนาคารทิสโก้ (TISCO)", value: "ธนาคารทิสโก้" },
  { label: "ธนาคารยูโอบี (UOB)", value: "ธนาคารยูโอบี" },
  {
    label: "ธนาคารแลนด์ แอนด์ เฮ้าส์ (LH Bank)",
    value: "ธนาคารแลนด์ แอนด์ เฮ้าส์",
  },
  {
    label: "ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย)",
    value: "ธนาคารสแตนดาร์ดชาร์เตอร์ด",
  },
  {
    label: "ธนาคารอิสลามแห่งประเทศไทย (ibank)",
    value: "ธนาคารอิสลามแห่งประเทศไทย",
  },
  { label: "พร้อมเพย์ (PromptPay)", value: "พร้อมเพย์" }, // เผื่อให้เป็นทางเลือกสำหรับพ่อค้าแม่ค้า
];
